## Syntax for while loop
## while condition:
      # Block of statement(s)

### The while loop statement repeatedly executes a code block while a particular condition is true.

In [3]:
count = 1
while count < 5:
    print(count)
    count = count +1

1
2
3
4

## The while loop enables the Python program to repeat a set of operations while a particular condition is true.
## When the condition becomes false, execution comes out of the loop immediately, and the first statement after the while loop is executed.

##  print numbers less than or equal to 10

In [1]:
count = 1
while count <= 10:
    print(count)
    count = count + 1

1
2
3
4
5
6
7
8
9
10

In [14]:
countnumber = 1
while countnumber < 10:
    print(countnumber)
    countnumber = countnumber + 1

1
2
3
4
5
6
7
8
9

## Check how many times a given number can be divided by 3 before it is less than or equal to 10.
## number = 180

In [7]:
count = 0 
number = 180 
while number > 10:
    number = number / 3
    count = count + 1
print(count)

3

## we want a user to enter any number between 100 and 500. We will keep asking the user to enter a correct input until he/she enters the number within a given range.

In [10]:
number = int(input("enter any number between 100 to 500"))
while number < 100 or number > 500:
    print("please enter a valid number")
    number = int(input("enter any number between 100 to 500"))
else:
    print("Given code is correct")

enter any number between 100 to 500 95

please enter a valid number

enter any number between 100 to 500 75

please enter a valid number

enter any number between 100 to 500 100

Given code is correct

In [11]:
number = int(input("enter any number a 10"))
while number != 10:
    print("please enter a valid number")
    number = int(input("enter any number a number10"))
else:
    print("Given code is correct")

enter any number a 10 6

please enter a valid number

enter any number a number10 10

Given code is correct

## Print even and odd numbers between 1 to the entered number.

In [13]:
number = int(input())
while number > 0:
    if number % 2 == 0:
        print(number, "is a even number")
    else:
        print(number , "is odd number")
    number = number - 1

 10

10 is a even number
9 is odd number
8 is a even number
7 is odd number
6 is a even number
5 is odd number
4 is a even number
3 is odd number
2 is a even number
1 is odd number

## A break statement terminates the loop containing it. If the break statement is used inside a nested loop (loop inside another loop), it will terminate the innermost loop.

## Write a while loop to display each character from a string and if a character is number then stop the loop.

## Reverse a while loop to display numbers from 10 to 1

In [7]:
number = 10 
while number > 0:
    print(number)
    number = number - 1

10
9
8
7
6
5
4
3
2
1

## Use while loop to print numbers from 11 to 25

In [13]:
number = 11 
while number < 26:
    print(number)
    number = number + 1

11
12
13
14
15
16
17
18
19
20
21
22
23
24
25

In [2]:
list1 = [11,13,15,12,14,16,18,20]

In [19]:
len(list1)

8

In [4]:
i = 0
while i < len(list1):
    if list1[i] % 2 == 0:
        print(list1[i], end = ",")
    i = i + 1

12,14,16,18,20,

In [5]:
for i in list1:
    if i % 2 == 0:
        print(i)

12
14
16
18
20

## write a programe to print first 10 natural number.

In [1]:
i = 1
while i < 11:
    print(i)
    i = i + 1

1
2
3
4
5
6
7
8
9
10

###  Note: remember to increment i, or else the loop will continue forever.

## write a programe to print first 10 even numbers.

In [4]:
l = [0,2,4,6,8,10,12,14,18,20]
len(l)

10

In [5]:
i = 0 
while i < 21:
    if i % 2 == 0:
        print(i)
    i = i + 1

0
2
4
6
8
10
12
14
16
18
20

In [2]:
i = 0 
while i < 21:
    print(i)
    i = i + 2

0
2
4
6
8
10
12
14
16
18
20

## write a programe to print first 10 odd numbers.

In [38]:
i = 1 
while i < 21:
    print(i)
    i = i + 2

1
3
5
7
9
11
13
15
17
19

## write a programe to print table of a number accepted from user.

In [1]:
number = int(input())
i = 1
while i < 11:
    print( number * i)
    i = i + 1

 2

2
4
6
8
10
12
14
16
18
20

## write a programe to find the factorial of a number.

In [3]:
number = int(input("please enter the number"))
factorial = 1
for i in range(1,number + 1):
    factorial = factorial * i
print(factorial)

please enter the number 5

120

In [4]:
number = int(input("please enter the number"))
factorial = 1
i = 1
while i < (number + 1):
    factorial = factorial * i
    i = i + 1
factorial

please enter the number 5

120

## The break Statement
## With the break statement we can stop the loop even if the while condition is true:

In [ ]:
Exit the loop when i is 3:

In [5]:
i = 1
while i < 6:

    print(i)
    if i == 3:
        break
    i = i + 1

1
2
3

In [9]:
password = 12
number = int(input("enter the password") )
i = 1
while i < 3:
    if password == number:
        print("correct password")
        break
    else:
        print("incorrect password")
        number = int(input("enter the password") )
    i = i + 1

enter the password 2

incorrect password

enter the password 4

incorrect password

enter the password 4

## The continue Statement
## With the continue statement we can stop the current iteration, and continue with the next:

# Continue to the next iteration if i is 3:

In [5]:
i = 0
while i < 100:
  i = i +  1
  if (i == 13) or  (i == 15):
    continue
  print(i, end = " ")

1 2 3 4 5 6 7 8 9 10 11 12 14 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100

In [2]:
i = 0
while i < 6:
    i = i +  1
    if i == 3:
        continue
    print(i)

1
2
4
5
6

In [6]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

## increase the maximum number of rows todisplay the entire DataFrame

In [14]:
import pandas as pd
data = pd.read_csv("C:\\Users\\Savita Seharawat\\Desktop\\data sets\\bank.csv")
data.head(10)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
5,35,management,single,tertiary,no,747,no,no,cellular,23,feb,141,2,176,3,failure,no
6,36,self-employed,married,tertiary,no,307,yes,no,cellular,14,may,341,1,330,2,other,no
7,39,technician,married,secondary,no,147,yes,no,cellular,6,may,151,2,-1,0,unknown,no
8,41,entrepreneur,married,tertiary,no,221,yes,no,unknown,14,may,57,2,-1,0,unknown,no
9,43,services,married,primary,no,-88,yes,yes,cellular,17,apr,313,1,147,2,failure,no

In [15]:
data.shape

(4521, 17)

In [19]:
data.head(8)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
5,35,management,single,tertiary,no,747,no,no,cellular,23,feb,141,2,176,3,failure,no
6,36,self-employed,married,tertiary,no,307,yes,no,cellular,14,may,341,1,330,2,other,no
7,39,technician,married,secondary,no,147,yes,no,cellular,6,may,151,2,-1,0,unknown,no

In [20]:
data.tail(5)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        4521 non-null   int64
 1   job        4521 non-null   object
 2   marital    4521 non-null   object
 3   education  4521 non-null   object
 4   default    4521 non-null   object
 5   balance    4521 non-null   int64
 6   housing    4521 non-null   object
 7   loan       4521 non-null   object
 8   contact    4521 non-null   object
 9   day        4521 non-null   int64
 10  month      4521 non-null   object
 11  duration   4521 non-null   int64
 12  campaign   4521 non-null   int64
 13  pdays      4521 non-null   int64
 14  previous   4521 non-null   int64
 15  poutcome   4521 non-null   object
 16  y          4521 non-null   object
dtypes: int64(7), object(10)
memory usage: 600.6+ KB

In [22]:
data.dtypes

age           int64
job          object
marital      object
education    object
default      object
balance       int64
housing      object
loan         object
contact      object
day           int64
month        object
duration      int64
campaign      int64
pdays         int64
previous      int64
poutcome     object
y            object
dtype: object

In [24]:
data["job"].unique()

array(['unemployed', 'services', 'management', 'blue-collar',
       'self-employed', 'technician', 'entrepreneur', 'admin.', 'student',
       'housemaid', 'retired', 'unknown'], dtype=object)

In [25]:
data["marital"].unique()

array(['married', 'single', 'divorced'], dtype=object)

In [27]:
data["loan"].unique()

array(['no', 'yes'], dtype=object)

In [23]:
data.head(2)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no

In [32]:
data["job"] = data["job"].astype("category")

In [33]:
data["job"].dtype

CategoricalDtype(categories=['admin.', 'blue-collar', 'entrepreneur', 'housemaid',
                  'management', 'retired', 'self-employed', 'services',
                  'student', 'technician', 'unemployed', 'unknown'],
, ordered=False)

In [28]:
data["job"].astype("category")

0          unemployed
1            services
2          management
3          management
4         blue-collar
            ...
4516         services
4517    self-employed
4518       technician
4519      blue-collar
4520     entrepreneur
Name: job, Length: 4521, dtype: category
Categories (12, object): ['admin.', 'blue-collar', 'entrepreneur', 'housemaid', ..., 'student', 'technician', 'unemployed', 'unknown']

In [27]:
data["job"] = data["job"].astype("category")
data["marital"] = data["marital"].astype("category")
data["education"] = data["education"].astype("category")
data["default"] = data["default"].astype("category")
data["housing"] = data["housing"].astype("category")
data["loan"] = data["loan"].astype("category")
data["contact"] = data["contact"].astype("category")
data["month"] = data["month"].astype("category")
data["poutcome"] = data["poutcome"].astype("category")
data["y"] = data["y"].astype("category")

In [28]:
data.dtypes

age             int64
job          category
marital      category
education    category
default      category
balance         int64
housing      category
loan         category
contact      category
day             int64
month        category
duration        int64
campaign        int64
pdays           int64
previous        int64
poutcome     category
y            category
dtype: object

In [29]:
data["month"].unique()

['oct', 'may', 'apr', 'jun', 'feb', ..., 'jul', 'nov', 'sep', 'mar', 'dec']
Length: 12
Categories (12, object): ['apr', 'aug', 'dec', 'feb', ..., 'may', 'nov', 'oct', 'sep']

In [31]:
data.shape

(4521, 17)

In [30]:
data["marital"].unique()

['married', 'single', 'divorced']
Categories (3, object): ['divorced', 'married', 'single']

In [33]:
data["marital"].value_counts()

married     2797
single      1196
divorced     528
Name: marital, dtype: int64

In [34]:
data.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

In [36]:
data.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
4516    False
4517    False
4518    False
4519    False
4520    False
Length: 4521, dtype: bool

In [37]:
data.duplicated().sum()

0

In [39]:
data

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

In [38]:
data.drop_duplicates()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

In [37]:
data.isnull().sum().sum()

0